app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users"
---
  def index
    session[:count] = 0  # Inicia el contador en 0
    session[:shown_users] = []  # Almacena los IDs de los usuarios ya mostrados
    @users = User.none  # Inicialmente, no mostramos ningún usuario
    @total_users = User.count  # Total de usuarios en la base de datos

SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" WHERE 1=1
---
  def refresh
    total_users = User.count

    if session[:count] < total_users
      session[:count] += 1
    end

    @new_user = User.where.not(id: session[:shown_users]).sample