app/controllers/users_controller.rb

    def index
        User.all
---
SELECT "users".* FROM "users"